
// Переробив класне завдання №3 з циклом while:

let arrNams = [2,17,13,6,22,31,45,66,100,-18];

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед):

// 1.(9): зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та перебрати
//  його циклом while але в зворотньому циклі (с заду на перед):

let i= arrNams.length-1;
while (i>=0){
    console.log(arrNams[i]);
    i-=1;
}

// 3.(9) перебрати циклом while та вивести  числа тільки з непарним
// індексом, але в зворотньому циклі (с заду на перед)

let i=arrNams.length-1;
 while (i>=0) {
     if (i % 2 === 0) {
         console.log(arrNams[i]);

     }
    i-=1;
 }

// 5.(9) перебрати циклом while та вивести  числа тільки парні
//  значення,але в зворотньому циклі (с заду на перед):
let i=arrNams.length-1;
while (i>=0) {
    let arrNam = arrNams[i];
    if (arrNam%2=== 0){
        console.log(arrNam)
    }
    i-=1;
}
